{"intents": [
        {"tag": "greeting",
         "patterns": ["Pleased to meet you", "It’s nice to meet you", "t’s great to see you", "Hey", "How’s it going?", "How’s your day?", "How’s your day going?", "Nice to see you!", "Good to see you!", "Long time no see!", "How’s everything ?", "How are things?", "Hi", "How are you?", "Hello", "Good day", "Hallo", "Good afternoon", "Good morning", "Good evening"],
         "responses": ["Hi, how can I help you?", "Hello, how can I help you?", "Hi there, how can I help you?"]
        },
        {"tag": "general",
         "patterns": ["Would you happen to know the details of a car", "Have any idea about a truck", "I wonder if you could tell me about a truck", "Do you have the details of a wagon", "Do you have info on a truck?", "What facts are available about the pickups", "What type of information do you have on the trucks", "Is there a chance you can provide me information regarding a vehicle", "Can you tell me about a transport", "Could you tell me about a tranportation vehicle", "I need to identify a vehicle", "I need information on a truck", "I would like to know something about a vehicle", "What can you tell me about the vehicles", "Tell me about your purpose", "I'm looking for some details of a wagon.", "I neeed data on a truck.", "What can you tell me about a vehicle", "How do I get details about a truck", "What should i do, in order to receive information about a lorry"],
         "responses": ["I can provide you the details of a truck based on its licence plate number (Please put the licence plate number into breckets: () )."]
        },
        {"tag": "location",
         "patterns": ["Locate the truck for me", "I need to know the location", "Where is the transport located", "I need to know the location of the truck", "Give me its GPS coordinates", "Let me know the car's coordinates", "Give me the details of its location", "Give me its position", "Where is it", "Where is the vehicle?", "Let me know the whereabouts of the truck", "In which neighbourhood is the truck located", "What is the location of the truck?", "Where is the wagon located?", "What is the van's position?", "Which region is the lorry in?", "What is the transport's whereabouts", "Which country is the van located in?", "In which city is the truck located", "In which town is the car in?"],
         "responses": ["The truck is located: ", "It's located in: ", "It's location is: "]
        },
        {"tag": "cargo",
         "patterns": ["Can you share with me the shipment details", "I need to know the cargo", "Give me the shipment info", "Tell me about the shipment", "Could you please provide me information on the shipment", "I need information on the cargo", "I want the shipment details", "I need details on the shipment", "What can you tell me about the truck's cargo", "Could you please provide me information about the truck's shipment", "Can you tell me anything about its cargo", "what is the cargo of the transpost", "what is the wagon carrying", "what is it transporting", "Give me the details of the cargo", "Let me know the cargo manifest of the truck", "What is the nature of its cargo", "what is its payload", "what is the freight of the truck", "what is it shipping"],
         "responses": ["The shipment is: ", "The payload is: ", "The cargo is: "]
        },
        {"tag": "specs",
         "patterns": ["Can you tell me the fleet number", "Can you provide me its height, length and what are the dimensions of the truck", "I need to know the specs", "What can you tell me about the truck itself", "Show me the design of the vehicle", "What is the model of the lorry", "I need the fleet number", "Give me the spacial dimensions and designation of the vehicle", "tell about the vehicle's designation", "what are the specifications of the freighter", "what can you tell me about the vehicle", "i need information on the delivery truck", "Give me the specs for the vehicle", "i need the specs of the car", "what are the specification of the freighter"],
	"responses": [] 
        }
   ]
}